src/DataProcessors/КД3_ЗагрузкаСтруктурыКонфигурацииИзФайловXMLМногопоточно.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>КД3_ЗагрузкаСтруктурыКонфигурацииИзФайловXMLМногопоточно</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Релизы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКаталогаЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗагрузкиДвижений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоДобавлятьНовые</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьРасширения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоОбновитьПланыОбмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расширения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяКаталогаЗагрузки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/КД3_ЗагрузкаСтруктурыКонфигурацииИзФайловXMLМногопоточно/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ВариантЗагрузкиДвижений = 1;
	Если Параметры.Свойство("парКонфигурация") И ЗначениеЗаполнено(Параметры.парКонфигурация) Тогда
		Объект.Конфигурация = Параметры.ПарКонфигурация;
		СпособЗагрузки = 1;
		Если Параметры.Свойство("ИсточникДанных") Тогда
			Объект.ИсточникДанных = Параметры.ИсточникДанных;
		КонецЕсли;
		Если Параметры.Свойство("КаталогЗагрузки") Тогда
			Объект.ИмяКаталогаЗагрузки = Параметры.КаталогЗагрузки;
		КонецЕсли;
		Если Параметры.Свойство("ВариантЗагрузкиДвижений") Тогда
			Объект.ВариантЗагрузкиДвижений = Параметры.ВариантЗагрузкиДвижений;
		КонецЕсли;

		Если Параметры.Свойство("ЕстьРасширения") Тогда
			Объект.ЕстьРасширения = Параметры.ЕстьРасширения;
			Если Параметры.ЕстьРасширения И Параметры.Свойство("Расширения") Тогда
				Для Каждого ИмяКаталога Из Параметры.Расширения Цикл
					НовСтрока = Объект.Расширения.Добавить();
					НовСтрока.ИмяКаталогаЗагрузки = ИмяКаталога;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//+КД3
	Если КД3_Настройки.ИспользоватьКонтекстнуюПодсказку() Тогда
		КД3_ЭтоСервер = ОбщегоНазначения.ИнформационнаяБазаФайловая();
		
		НастройкиКонфигурации = КД3_Метаданные.НастройкиКонфигурации(
			?(СпособЗагрузки = 0, Неопределено, Объект.Конфигурация));
		КД3_МестоХраненияИндексов = НастройкиКонфигурации.МестоХраненияИндексов;
		КД3_КаталогИндексов = НастройкиКонфигурации.КаталогИндексов;
		КД3_ЗагружатьМетодыМодулей = НастройкиКонфигурации.ЗагружатьМетодыМодулей;
		
		КД3_УстановитьВидимостьПоМестуХраненияИндексов(ЭтотОбъект);
		
		КД3_ЗаполнитьМестоХраненияИндексов(ЭтотОбъект, НастройкиКонфигурации.ЗагружатьИзФайлов);
		КД3_ОбновитьНадписьЗагружаемыхМодулей(ЭтотОбъект, НастройкиКонфигурации.ЗагружатьИзФайлов);
	Иначе
		Элементы.КД3_ГруппаКонтекстнаяПодсказка.Видимость = Ложь;
	КонецЕсли;
	//-КД3
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Объект.Конфигурация) Тогда
		СпособЗагрузки = 1;
	КонецЕсли;
	
	УстановитьВидимость();
	//+КД3
	КД3_ИзменитьРежимОбработки();
	КД3_УстановитьВидимостьПоМестуХраненияИндексов(ЭтотОбъект);
	//-КД3
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяКаталогаЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ЗавершениеВыбораКаталога", ЭтотОбъект, Новый Структура("ВыборРасширения", Ложь));
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если ЗначениеЗаполнено(Объект.ИмяКаталогаЗагрузки) Тогда
		ДиалогВыбора.Каталог = Объект.ИмяКаталогаЗагрузки;
	КонецЕсли;
	ДиалогВыбора.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура РасширенияИмяКаталогаЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ЗавершениеВыбораКаталога", ЭтотОбъект, Новый Структура("ВыборРасширения", Истина));
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ТекКаталог = Элементы.Расширения.ТекущиеДанные.ИмяКаталогаЗагрузки;
	Если ЗначениеЗаполнено(ТекКаталог) Тогда
		ДиалогВыбора.Каталог = ТекКаталог;
	КонецЕсли;
	ДиалогВыбора.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура СпособЗагрузкиПриИзменении(Элемент)
	Если СпособЗагрузки = 0 Тогда
		Объект.ТолькоДобавлятьНовые = Ложь;
		Объект.ТолькоОбновитьПланыОбмена = Ложь;
	КонецЕсли;
	УстановитьВидимость();
	//+КД3
	КД3_ПриИзмененииКонфигурации();
	//-КД3
КонецПроцедуры

&НаКлиенте
Процедура ЕстьРасширенияПриИзменении(Элемент)
	УстановитьВидимость();
	 
КонецПроцедуры

&НаКлиенте
Процедура КД3_НаКлиенте(Команда)
	
	Если КД3_ЭтоСервер Тогда
		КД3_ЭтоСервер = Ложь;
		КД3_ИзменитьРежимОбработки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КД3_НаСервере(Команда)
	
	Если НЕ КД3_ЭтоСервер Тогда
		КД3_ЭтоСервер = Истина;
		КД3_ИзменитьРежимОбработки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КД3_ИзменитьРежимОбработки()
	
	КоманднаяПанель.ПодчиненныеЭлементы.КД3_РежимРаботы.ПодчиненныеЭлементы.ФормаНаКлиенте.Пометка = НЕ КД3_ЭтоСервер;
	КоманднаяПанель.ПодчиненныеЭлементы.КД3_РежимРаботы.ПодчиненныеЭлементы.ФормаНаСервере.Пометка = КД3_ЭтоСервер;
	
	КоманднаяПанель.ПодчиненныеЭлементы.КД3_РежимРаботы.Заголовок = 
	?(КД3_ЭтоСервер, НСтр("ru = 'Режим работы (на сервере)'"), НСтр("ru = 'Режим работы (на клиенте)'"));
	
	Если ОбщегоНазначенияКлиент.ИнформационнаяБазаФайловая() Тогда
		КД3_КоличествоПотоков = 1;
		Элементы.КД3_КоличествоПотоков.Видимость = Ложь;
	Иначе
		КД3_КоличествоПотоков = ?(КД3_ЭтоСервер, КД3_НастройкиКлиент.ЗначениеИзКэша("КоличествоПотоков"), 1);
		Элементы.КД3_КоличествоПотоков.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КД3_КаталогИндексовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("КД3_КаталогИндексовЗавершениеВыбора", ЭтотОбъект);
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если ЗначениеЗаполнено(Объект.ИмяКаталогаЗагрузки) Тогда
		ДиалогВыбора.Каталог = Объект.ИмяКаталогаЗагрузки;
	КонецЕсли;
	ДиалогВыбора.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура КД3_КаталогИндексовЗавершениеВыбора(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	КД3_КаталогИндексов = Результат[0];
КонецПроцедуры

&НаКлиенте
Процедура КД3_ЗагружатьМетодыМодулейПриИзменении(Элемент)
	КД3_ОбновитьНадписьЗагружаемыхМодулей(ЭтотОбъект, КД3_СохранитьКаталогДляКонфигурации);
КонецПроцедуры

&НаКлиенте
Процедура КД3_КонфигурацияПриИзменении(Элемент)
	КД3_ПриИзмененииКонфигурации();
КонецПроцедуры

&НаКлиенте
Процедура КД3_МестоХранениеИндексовПриИзменении(Элемент)
	КД3_УстановитьВидимостьПоМестуХраненияИндексов(ЭтотОбъект);
	Если КД3_МестоХраненияИндексов = 0 Тогда
		КД3_ЗагружатьМетодыМодулей = Ложь;
		КД3_СохранитьКаталогДляКонфигурации = Ложь;
		НастройкиКонфигурации = КД3_МетаданныеКлиент.НастройкиКонфигурации(
			?(СпособЗагрузки = 0, Неопределено, Объект.Конфигурация));
		КД3_ЗаполнитьМестоХраненияИндексов(ЭтотОбъект, НастройкиКонфигурации.ЗагружатьИзФайлов);
		КД3_ОбновитьНадписьЗагружаемыхМодулей(ЭтотОбъект, НастройкиКонфигурации.ЗагружатьИзФайлов ИЛИ КД3_СохранитьКаталогДляКонфигурации);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КД3_КаталогИндексовОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ФайловаяСистемаКлиент.ОткрытьПроводник(КД3_КаталогИндексов);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьЗагрузку(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ИмяКаталогаЗагрузки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбран каталог со структурой конфигурации'"));
		Возврат;
	КонецЕсли;
	Если СпособЗагрузки = 1 И НЕ ЗначениеЗаполнено(Объект.Конфигурация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбрана конфигурация для загрузки'"));
		Возврат;
	КонецЕсли;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Ожидание;
	ИзменитьДоступностьЭлементовФормы(Ложь);
	ПодготовитьФайлыДляСервераНачало(); 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура КД3_ОбновитьНадписьЗагружаемыхМодулей(Форма, ЗагружатьИзФайлов)
	ЭлементНадпись = Форма.Элементы.КД3_ИнфоЗагружаемыеМодули;
	ЭлементНадпись.Видимость = Форма.КД3_ЗагружатьМетодыМодулей;
	Если ЗагружатьИзФайлов Тогда
		ЭлементНадпись.Заголовок =
			"Для конфигурации указан каталог исходных кодов.
			|Будут загружены только процедуры/функции глобального контекста.";
	Иначе
		ЭлементНадпись.Заголовок =
			"Для конфигурации не указан каталог исходных кодов.
			|Будут загружены процедуры/функции всех модулей.";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьФайлыДляСервераНачало()
	АдресХранилищаРезультата = "";
	
	//+КД3
	ПараметрыЗагрузки = Новый Структура;
	ПараметрыЗагрузки.Вставить("ИсточникДанных", Объект.ИсточникДанных);
	ПараметрыЗагрузки.Вставить("КаталогЗагрузки", Объект.ИмяКаталогаЗагрузки);
	ПараметрыЗагрузки.Вставить("ТолькоОбновитьПланыОбмена", Объект.ТолькоОбновитьПланыОбмена);
	ПараметрыЗагрузки.Вставить("КД3_ЗагружатьМетодыМодулей", КД3_ЗагружатьМетодыМодулей);
	ПараметрыЗагрузки.Вставить("КД3_ИспользоватьКонтекстнуюПодсказку", КД3_НастройкиКлиент.ИспользоватьКонтекстнуюПодсказку());
	ПараметрыЗагрузки.Вставить("КД3_ЭтоСервер", КД3_ЭтоСервер);
	ПараметрыЗагрузки.Вставить("КД3_СохранитьКаталогДляКонфигурации", КД3_СохранитьКаталогДляКонфигурации);
	ПараметрыЗагрузки.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	
	ПараметрыЗагрузки.Вставить("КаталогиРасширений", Новый Массив);
	Для Каждого СтрокаРасширения Из Объект.Расширения Цикл
		ПараметрыЗагрузки.КаталогиРасширений.Добавить(СтрокаРасширения.ИмяКаталогаЗагрузки);
	КонецЦикла;
	ПараметрыЗагрузки.Вставить("ЕстьРасширения", ПараметрыЗагрузки.КаталогиРасширений.Количество() > 0);
	
	КД3_ЗагрузкаМетаданныхКлиентСервер.ПодготовитьФайлыДляЗагрузки(ПараметрыЗагрузки);
	//-КД3
	
	ВыполнитьЗагрузкуСервер(ПараметрыЗагрузки);
	
	//+КД3
	КД3_ПрогрессТекст0 = "Обработка данных файлов";
	КД3_Прогресс0 = "";
	ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 5, Истина);
	//-КД3
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияДлительнойОперации()
	Если НЕ ДлительнаяОперация Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Основная;
		ИзменитьДоступностьЭлементовФормы(Истина);
		Возврат;
	КонецЕсли;
	Если ДлительнаяОперацияВыполнена() Тогда
		ДлительнаяОперация = Ложь;
		ПодключитьОбработчикОжидания("ОкончаниеЗагрузкиКонфигурации", 1, Истина);
	Иначе
		ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 5, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияВыполнена()
	Если ИдентификаторЗадания = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	//+КД3
	КД3_ЗагрузкаМетаданных.ОбновитьПрогрессНаФорме(ИдентификаторЗадания, ЭтотОбъект);
	//-КД3
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
КонецФункции

&НаКлиенте
Процедура ОкончаниеЗагрузкиКонфигурации()
	РезультатЗагрузки = ПолучитьИзВременногоХранилища(АдресХранилищаРезультата);
	Если РезультатЗагрузки Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Загрузка структуры конфигурации выполнена успешно'"));
		//+КД3
		// При успешной загрузке необходимо очистить локальный кэш конфигурации
		Если СпособЗагрузки = 1 И ЗначениеЗаполнено(Объект.Конфигурация) Тогда
			КД3_МетаданныеКлиент.СброситьОписаниеМетаданныхВКэше(Объект.Конфигурация);
			КД3_МетаданныеКлиент.СброситьНастройкиКонфигурацииВКэше(Объект.Конфигурация);
		КонецЕсли;
		//-КД3
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Загрузка структуры конфигурации не выполнена'"));
	КонецЕсли;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Основная;
	ИзменитьДоступностьЭлементовФормы(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДоступностьЭлементовФормы(ФлагДоступность)
	Элементы.ФормаВыполнитьЗагрузку.Доступность = ФлагДоступность;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	ЗагружатьВКонфигурацию = (СпособЗагрузки = 1);
	Элементы.Конфигурация.Видимость = ЗагружатьВКонфигурацию;
	Элементы.ТолькоДобавлятьНовые.Видимость = ЗагружатьВКонфигурацию;
	Элементы.Расширения.Видимость = Объект.ЕстьРасширения;
	Элементы.ТолькоОбновитьПланыОбмена.Видимость = ЗагружатьВКонфигурацию;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗагрузкуСервер(ПараметрыЗагрузки)
	ИдентификаторЗадания = Неопределено;
	ДлительнаяОперация = Ложь;
	АдресХранилищаРезультата = "";
	//+КД3
	Если НЕ КД3_ЭтоСервер Тогда
		// Преобразование помещенных файлов
		Для Каждого ПомФайл Из ПараметрыЗагрузки.ПомещенныеФайлы Цикл
			ИмяФайлаСведений = ПолучитьИмяВременногоФайла("xml");
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПомФайл.Хранение);
			ДвоичныеДанные.Записать(ИмяФайлаСведений);
			
			УдалитьИзВременногоХранилища(ПомФайл.Хранение);
			ПомФайл.Хранение = ИмяФайлаСведений;
		КонецЦикла;
	КонецЕсли;
	СтруктураПараметров = ПараметрыЗагрузки;
	СтруктураПараметров.Вставить("СпособЗагрузки", СпособЗагрузки);
	СтруктураПараметров.Вставить("Конфигурация", Объект.Конфигурация);
	СтруктураПараметров.Вставить("ВариантЗагрузкиДвижений", Объект.ВариантЗагрузкиДвижений);
	СтруктураПараметров.Вставить("ТолькоДобавлятьНовые", Объект.ТолькоДобавлятьНовые);
	СтруктураПараметров.Вставить("КД3_МестоХраненияИндексов", КД3_МестоХраненияИндексов);
	СтруктураПараметров.Вставить("КД3_КаталогИндексов", КД3_КаталогИндексов);
	СтруктураПараметров.Вставить("КД3_СохранитьКаталогДляКонфигурации", КД3_СохранитьКаталогДляКонфигурации);
	СтруктураПараметров.Вставить("КД3_СообщатьПрогресс");
	СтруктураПараметров.Вставить("КД3_КоличествоПотоков", КД3_КоличествоПотоков);
	//-КД3
	Попытка
		ПараметрыФоновогоЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыФоновогоЗадания.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка структуры метаданных из каталога'");
		ПараметрыФоновогоЗадания.ЗапуститьВФоне = Истина;
		Результат = ДлительныеОперации.ВыполнитьВФоне("Обработки.КД3_ЗагрузкаСтруктурыКонфигурацииИзФайловXMLМногопоточно.ВыполнитьЗагрузкуМетаданных",
			СтруктураПараметров, ПараметрыФоновогоЗадания);
		АдресХранилищаРезультата = Результат.АдресРезультата;
		Если Результат.Статус = "Выполнено" Тогда
			РезультатЗагрузки = ПолучитьИзВременногоХранилища(АдресХранилищаРезультата);
			Если РезультатЗагрузки Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Загрузка структуры конфигурации выполнена успешно'"));
			Иначе
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Загрузка структуры конфигурации не выполнена'"));
			КонецЕсли;
			Попытка
				УдалитьФайлы(ИмяФайлаСведений);
			Исключение
				ИмяФайлаСведений = "";
			КонецПопытки;
		Иначе
			ДлительнаяОперация = Истина;
			ИдентификаторЗадания = Результат.ИдентификаторЗадания;
		КонецЕсли;
	Исключение
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'При загрузке структуры конфигурации произошла ошибка'") + Символы.ПС + ОписаниеОшибки());
		Возврат;
	КонецПопытки
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыбораКаталога(Знач ВыбранныеФайлы, Знач ДопПараметры) Экспорт
	Если ВыбранныеФайлы = Неопределено Или НЕ ДопПараметры.Свойство("ВыборРасширения") Тогда
		Возврат;
	КонецЕсли;
	Если ДопПараметры.ВыборРасширения Тогда
		НомСтроки = Элементы.Расширения.ТекущиеДанные.НомерСтроки;
		Объект.Расширения[НомСтроки - 1].ИмяКаталогаЗагрузки = ВыбранныеФайлы[0];
	Иначе
		Объект.ИмяКаталогаЗагрузки = ВыбранныеФайлы[0];
	КонецЕсли;
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура КД3_ЗаполнитьМестоХраненияИндексов(Форма, ЗагружатьИзФайлов)
	
	СписокВыбора = Форма.Элементы.КД3_МестоХраненияИндексов.СписокВыбора;
	
	СписокВыбора.Очистить();
	СписокВыбора.Добавить(0, "Не использовать");
	СписокВыбора.Добавить(1, "В каталоге");
	СписокВыбора.Добавить(2, "В информационной базе");
	Если ЗагружатьИзФайлов Тогда
		СписокВыбора.Добавить(3, "Не хранить");
	КонецЕсли;
	
	Если СписокВыбора.НайтиПоЗначению(Форма.КД3_МестоХраненияИндексов) = Неопределено Тогда
		Форма.КД3_МестоХраненияИндексов = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КД3_УказатьКаталогФайловВКонфигурацииПриИзменении(Элемент)
	НастройкиКонфигурации = КД3_МетаданныеКлиент.НастройкиКонфигурации(
		?(СпособЗагрузки = 0, Неопределено, Объект.Конфигурация));
	КД3_ОбновитьНадписьЗагружаемыхМодулей(ЭтотОбъект, НастройкиКонфигурации.ЗагружатьИзФайлов ИЛИ КД3_СохранитьКаталогДляКонфигурации);
	КД3_ЗаполнитьМестоХраненияИндексов(ЭтотОбъект, НастройкиКонфигурации.ЗагружатьИзФайлов ИЛИ КД3_СохранитьКаталогДляКонфигурации);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура КД3_УстановитьВидимостьПоМестуХраненияИндексов(Форма)
	Форма.Элементы.КД3_КаталогИндексов.Видимость = Форма.КД3_МестоХраненияИндексов = 1;
	Форма.Элементы.КД3_ЗагружатьМетодыМодулей.Доступность = Форма.КД3_МестоХраненияИндексов > 0;
	Форма.Элементы.КД3_СохранитьКаталогДляКонфигурации.Доступность = Форма.КД3_МестоХраненияИндексов > 0;
КонецПроцедуры

&НаКлиенте
Процедура КД3_ПриИзмененииКонфигурации()
	
	НастройкиКонфигурации = КД3_МетаданныеКлиент.НастройкиКонфигурации(
		?(СпособЗагрузки = 0, Неопределено, Объект.Конфигурация));
	КД3_МестоХраненияИндексов = НастройкиКонфигурации.МестоХраненияИндексов;
	КД3_КаталогИндексов = НастройкиКонфигурации.КаталогИндексов;
	КД3_ЗагружатьМетодыМодулей = НастройкиКонфигурации.ЗагружатьМетодыМодулей;
	Если КД3_МестоХраненияИндексов = 0 Тогда
		КД3_ЗагружатьМетодыМодулей = Ложь;
		КД3_СохранитьКаталогДляКонфигурации = Ложь;
	КонецЕсли;
	КД3_ЗаполнитьМестоХраненияИндексов(ЭтотОбъект, НастройкиКонфигурации.ЗагружатьИзФайлов);
	КД3_ОбновитьНадписьЗагружаемыхМодулей(ЭтотОбъект, НастройкиКонфигурации.ЗагружатьИзФайлов ИЛИ КД3_СохранитьКаталогДляКонфигурации);
	
	КД3_УстановитьВидимостьПоМестуХраненияИндексов(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти
